<?php
$msgA = array(
	"1" 		=> "付款成功",
	"2" 		=> "建立訂單成功",
	"800" 		=> "貨到付款訂單建立成功",
	"10200001"	=> "無法使用此服務",
	"10200002" 		=> "交易已處理",
	"10200003" 		=> "交易狀態錯誤",
	"10200005" 		=> "金額格式錯誤",
	"10200007" 		=> "URL 格式錯誤",
	"10200050" 		=> "AllPay 交易編號錯誤",
	"10200051" 		=> "廠商編號錯誤",
	"10200052" 		=> "廠商交易編號錯誤",
	"10100001" 		=> "IP 拒絕存取",
	"10100054" 		=> "交易編號重覆",
	"10100073" 		=> "取號成功",
	"10200073" 		=> "檢查碼錯誤",
	"10100055" 		=> "建立訂單失敗",
	"10100058" 		=> "付款失敗",
	"10100059" 		=> "找不到訂單編號"
);

/*$msgCode = '1';
echo $msgA[$msgCode].'<br>';
var_dump($msgA);*/
?>