<?php 
/*$statusA = array(
			"1.新近未處理",
			"2.銀行轉帳:訂單確認，待匯款，未寄出",
			"2.貨到付款:訂單確認，未收款",
			"2.線上刷卡:訂單確認，未收款",
			"3.銀行轉帳:已匯款，未寄出",
			"3.貨到付款:店取，確認有貨，待取",
			"3.貨到付款:貨物已寄出，未收款",
			"3.線上刷卡:已刷卡，未寄出",
			"4.銀行轉帳:寄出商品",
			"4.貨到付款:店取，客戶已結帳，交易結束",
			"4.貨到付款:客戶已收到，未確認收款",
			"4.線上刷卡:寄出商品",
			"5.銀行轉帳:客戶已收到，交易結束",
			"5.貨到付款:已收款，交易結束",
			"5.線上刷卡:客戶已收到，交易結束"
			);*/
$statusA_1 = array(
			"未刷卡",
			"刷卡成功",
			"刷卡失敗",
			"訂單作廢"
			);
$statusA_2 = array(
			"未付款",
			"款項確認中",
			"已付款",
			"訂單作廢",
			"訂單完成",
			"已退款"
			);
$statusB = array(
			"準備中",
			"已出貨",
			"派車回收中",
			"等待退貨商品入庫中",
			"退貨與退款完成"
			);
?>